Конфигурация/Documents/ПриходПроцентовПоКредитномуИнструменту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПриходПроцентовПоКредитномуИнструменту</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ПроцентыПоКредитнымИнструментам</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваВКредитныхИнструментах</xr:Item>
				<xr:Item>InformationRegister.НоминалыКредитныхИнструментов</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.РеестрПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КредитныйИнструмент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КредитныеИнструменты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтложеннаяОплата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Comment>Дата начала интервала, за который начисляются проценты</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Comment>Дата окончания интервала, за который начисляются проценты</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реинвестирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастичныйПриходПроцентов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаБанковскойВыписки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СтрокаБанковскойВыписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ДенежныеСредстваВКредитныхИнструментах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваВКредитныхИнструментах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипКредитногоИнструмента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКредитныхИнструментов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКредитногоИнструмента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКредитныхИнструментов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КредитныйИнструмент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КредитныеИнструменты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ПроцентыПоКредитнымИнструментам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПроцентыПоКредитнымИнструментам</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Частичный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КредитныйИнструмент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КредитныеИнструменты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ОстаткиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженийДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийПриВводеВыводеДенежныхСредств</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыПереводовДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ЗадолженностиПоДенежнымСредствам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностиПоДенежнымСредствам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/AccountingRegisters/ЕдиныйБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccountingRegister>
		<Properties>
			<Name>ЕдиныйБухгалтерскийУчет</Name>
			<ChartOfAccounts>ChartOfAccounts.Единый</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Единый.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Единый.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Единый.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОпераций</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяАналитикаДт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяАналитикаКт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПартии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыКредитныхИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыКредитныхИнструментов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выданный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полученный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ПриходПроцентовПоКредитномуИнструменту/Ext/ObjectModule.bsl
Процедура УстановитьБлокировки()

	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;	
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах");
	ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("КредитныйИнструмент",              ЭтотОбъект.КредитныйИнструмент);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);

	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ПроцентыПоКредитнымИнструментам");
	ЭлементБлокировкиДанных.УстановитьЗначение("КредитныйИнструмент", ЭтотОбъект.КредитныйИнструмент);
	
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.УсловияКредитныхИнструментов");
	ЭлементБлокировкиДанных.УстановитьЗначение("КредитныйИнструмент", ЭтотОбъект.КредитныйИнструмент);

	БлокировкаДанных.Заблокировать();

КонецПроцедуры // УстановитьБлокировки

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	УстановитьБлокировки();
	
	// новая схема проведения
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
	
	Движения.ДенежныеСредстваВКредитныхИнструментах.Записывать        = Истина;
	Движения.ОстаткиДенежныхСредств.Записывать                        = Истина;
	Движения.ПроцентыПоКредитнымИнструментам.Записывать 			  = Истина;
	Движения.НоминалыКредитныхИнструментов.Записывать				  = Истина;
	Движения.ЗадолженностиПоДенежнымСредствам.Записывать			  = Истина;
	
	ЭтоДепозитныйВклад = ТипЗнч(ЭтотОбъект.КредитныйИнструмент) = Тип("СправочникСсылка.ДепозитныеВклады");
	Если ЭтоДепозитныйВклад Тогда
		ВидДвижения = ВидДвиженияНакопления.Приход;
		ВидДвиженияДенежныхСредствПроценты = Перечисления.ВидыДвиженийДенежныхСредств.ПриходПроцентовПоДепозитномуВкладу;
	Иначе
		Если ЭтотОбъект.КредитныйИнструмент.ВидКредитногоИнструмента = Перечисления.ВидыКредитныхИнструментов.Выданный тогда
			ВидДвижения = ВидДвиженияНакопления.Приход;
			ВидДвиженияДенежныхСредствПроценты = Перечисления.ВидыДвиженийДенежныхСредств.ПриходПроцентовПоЗаймуВыданному;
		Иначе
			ВидДвижения = ВидДвиженияНакопления.Расход;
			ВидДвиженияДенежныхСредствПроценты = Перечисления.ВидыДвиженийДенежныхСредств.ВыплатаПроцентовПоЗаймуПолученному;
		КонецЕсли;
	КонецЕсли;
	
	Если Реинвестирование Тогда
		// д/с на депозитах
		Движение = Движения.ДенежныеСредстваВКредитныхИнструментах.ДобавитьПриход();
		
		Движение.Период						  = ЭтотОбъект.Дата;
		Движение.Организация				  = ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;		
		Движение.КредитныйИнструмент	 	  = ЭтотОбъект.КредитныйИнструмент;
		Движение.ВидКредитногоИнструмента	  = Перечисления.ВидыКредитныхИнструментов.Выданный;
		Движение.ТипКредитногоИнструмента	  = Перечисления.ТипыКредитныхИнструментов.ДепозитныйВклад;
		Движение.Сумма						  = ЭтотОбъект.Сумма;
		
	ИначеЕсли ОтложеннаяОплата Тогда
		
		Движение = Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
		Движение.Период                       = ЭтотОбъект.Дата;
		Движение.Основание                    = ЭтотОбъект.Ссылка;
		Если ЭтоДепозитныйВклад Тогда
			Движение.ТипЗадолженности             = Перечисления.ТипыЗадолженности.Дебиторская;
			Движение.ВидЗадолженности             = Справочники.ВидыЗадолженности.ПоДепозитномуВкладуПроценты;
			Движение.Контрагент                   = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Банк.ЮрФизЛицо;    
			Движение.Валюта 				  	  = ?(ЗначениеЗаполнено(ЭтотОбъект.РасчетныйСчет), ЭтотОбъект.РасчетныйСчет.Валюта, ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта);			
		Иначе
			ДанныеКредитногоИнструмента = РаботаСКредитнымиИнструментами.ПолучитьДанныеКредитногоИнструмента(ЭтотОбъект.КредитныйИнструмент, ЭтотОбъект.Дата);
			
			Если ЭтотОбъект.КредитныйИнструмент.ВидКредитногоИнструмента = Перечисления.ВидыКредитныхИнструментов.Выданный Тогда
				Движение.ТипЗадолженности             = Перечисления.ТипыЗадолженности.Дебиторская;
			Иначе
				Движение.ТипЗадолженности             = Перечисления.ТипыЗадолженности.Кредиторская;
			КонецЕсли;
			Движение.ВидЗадолженности             = Справочники.ВидыЗадолженности.ПоЗаймуПроценты;
			Движение.Контрагент                   = ДанныеКредитногоИнструмента.Контрагент;
			Движение.Валюта 				  	  = ?(ЗначениеЗаполнено(ЭтотОбъект.РасчетныйСчет), ЭтотОбъект.РасчетныйСчет.Валюта, ЭтотОбъект.КредитныйИнструмент.Валюта);	
		КонецЕсли;
		Движение.Организация                  = ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
		Движение.Сумма                        = ЭтотОбъект.Сумма;
		
	Иначе
		// остатки д/с
		Движение = Движения.ОстаткиДенежныхСредств.Добавить();
		
		Движение.ВидДвижения 				  = ВидДвижения;
		Движение.Период				 		  = ЭтотОбъект.Дата;
		Движение.Организация				  = ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
		Движение.МестоХранения                = Справочники.МестаХранения.ВнебиржевойРынок;
		Движение.РасчетныйСчет 				  = ЭтотОбъект.РасчетныйСчет;
		Движение.Валюта						  = ЭтотОбъект.РасчетныйСчет.Валюта;
		Движение.Сумма						  = ЭтотОбъект.Сумма;
		Движение.ВидДвиженияДенежныхСредств   = ВидДвиженияДенежныхСредствПроценты;
		
	КонецЕсли; 
	
	// приход %
	Движение = Движения.ПроцентыПоКредитнымИнструментам.Добавить();
	
	Движение.Период						  = ЭтотОбъект.Дата;
	Движение.Организация				  = ЭтотОбъект.Организация;
	Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
	Движение.КредитныйИнструмент 		  = ЭтотОбъект.КредитныйИнструмент;
	Движение.НачалоПериода			   	  = ЭтотОбъект.НачалоПериода;
	Движение.ОкончаниеПериода			  = ЭтотОбъект.ОкончаниеПериода;
	Движение.Частичный                    = ЭтотОбъект.ЧастичныйПриходПроцентов;
	Движение.Сумма						  = ЭтотОбъект.Сумма;
	
	Движения.Записать();
	
	// реестр платежей
	РегистрыСведений.РеестрПлатежей.ЗарегистрироватьПлатеж(ЭтотОбъект,
		РегистрыСведений.РеестрПлатежей.СкомпоноватьСведенияОСтрокеБанковскойВыписки(
			ЭтотОбъект.СтрокаБанковскойВыписки,
			Перечисления.ВидыДвижений.Приход,
			ЭтотОбъект.Сумма,
			ВидДвиженияДенежныхСредствПроценты));
			
	РегистрыСведений.НоминалыКредитныхИнструментов.УстановитьНоминалКредитногоИнструмента(ЭтотОбъект);			
			
КонецПроцедуры // ПроведениеПоРегистрамБэкОфиса

Процедура ПроведениеПоРегиструЕПС(УчетныйРегистр, Отказ) Экспорт

	Если ТипЗнч(ЭтотОбъект.КредитныйИнструмент) = Тип("СправочникСсылка.Займы") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не реализовано проведение по ЕПС закрытия займа", ЭтотОбъект.Ссылка,,,Отказ);
		Возврат;
	КонецЕсли;
	
	Закрывать7ойРазделПриПоступленииДенежныхСредств = БухгалтерскийУчет.Закрывать7ойРазделПриПоступленииДенежныхСредств(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчета(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления);
	
	УчетныйАктив = Справочники.ДепозитныеВклады.ОпределитьУчетныйАктивДепозита(ЭтотОбъект.КредитныйИнструмент, ЭтотОбъект.Дата);
	
	Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;	
	
	Если Справочники.ДепозитныеВклады.ПолучитьПериодичностьВыплатыПроцентов(ЭтотОбъект.КредитныйИнструмент, ЭтотОбъект.Дата) = Перечисления.ПериодичностиВыплатыПроцентов.Авансом Тогда
		
		СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЭтотОбъект.Сумма, ЭтотОбъект.РасчетныйСчет.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Приход процентов по депозитному вкладу");
		
		Проводка.СчетДт = ?(Справочники.Банки.ЯвляетсяРезидентом(ЭтотОбъект.РасчетныйСчет.Банк,Дата), ПланыСчетов.Единый.РасчетныеСчета01, ПланыСчетов.Единый.РасчетныеСчета02);
		Проводка.СубконтоДт.БанковскиеСчета = ЭтотОбъект.РасчетныйСчет;
		Проводка.СубконтоДт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ПроцентыПоДепозитномуВкладу;
		Проводка.ВалютаДт = ЭтотОбъект.РасчетныйСчет.Валюта;
		Проводка.ВалютнаяСуммаДт = ЭтотОбъект.Сумма;
		
		Проводка.СчетКт = ПланыСчетов.Единый.Депозиты13;
		Проводка.СубконтоКт.БанковскиеСчета = ЭтотОбъект.РасчетныйСчет;
		Проводка.СубконтоКт.УсловияЗаймовКредитовИДепозитов = ЭтотОбъект.КредитныйИнструмент;
		Проводка.ВалютаКт  = ЭтотОбъект.РасчетныйСчет.Валюта;
		Проводка.ВалютнаяСуммаКт = ЭтотОбъект.Сумма;
		
		//считаем, что выплата процентов прошла до их начисления, поэтому 20613 и 20603 не закрываем. Если окажется, что надо, то нужно код закрытия этих счетов из переоценки вынести в отдельную процедуру.
		Если ЭтотОбъект.КредитныйИнструмент.ДатаНачалаНачисленияПроцентов < НачалоДня(ЭтотОбъект.Дата) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проценты по депозитному вкладу "+ЭтотОбъект.КредитныйИнструмент+" пришли после начала их начисления. Закрытие счетов 20613 и 20603 не реализовано. Обратитесь к программистам", ЭтотОбъект.Ссылка,,,Отказ);
		КонецЕсли;
		
	Иначе
		// пришли %
		СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЭтотОбъект.Сумма, ЭтотОбъект.РасчетныйСчет.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Приход процентов по депозитному вкладу");
		
		Проводка.СчетДт = ?(Справочники.Банки.ЯвляетсяРезидентом(ЭтотОбъект.РасчетныйСчет.Банк,Дата), ПланыСчетов.Единый.РасчетныеСчета01, ПланыСчетов.Единый.РасчетныеСчета02);
		Проводка.СубконтоДт.БанковскиеСчета = ЭтотОбъект.РасчетныйСчет;
		Проводка.СубконтоДт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ПроцентыПоДепозитномуВкладу;
		Проводка.ВалютаДт = ЭтотОбъект.РасчетныйСчет.Валюта;
		Проводка.ВалютнаяСуммаДт = ЭтотОбъект.Сумма;
		
		Если НастройкиУчета.ИспользоватьСчетРасчетовПоПроцентамДляДепозитов Тогда
		
			Проводка.СчетКт = ПланыСчетов.Единый.Депозиты13;
			Проводка.СубконтоКт.БанковскиеСчета = ЭтотОбъект.РасчетныйСчет;
			Проводка.СубконтоКт.УсловияЗаймовКредитовИДепозитов = ЭтотОбъект.КредитныйИнструмент;
			Проводка.ВалютаКт  = ЭтотОбъект.РасчетныйСчет.Валюта;
			Проводка.ВалютнаяСуммаКт = ЭтотОбъект.Сумма;
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Приход процентов по депозитному вкладу");
			
			Проводка.СчетДт = ПланыСчетов.Единый.Депозиты13;
			Проводка.СубконтоДт.БанковскиеСчета = ЭтотОбъект.РасчетныйСчет;
			Проводка.СубконтоДт.УсловияЗаймовКредитовИДепозитов = ЭтотОбъект.КредитныйИнструмент;
			Проводка.ВалютаДт = ЭтотОбъект.РасчетныйСчет.Валюта;
			Проводка.ВалютнаяСуммаДт = ЭтотОбъект.Сумма;
		
		КонецЕсли;
		
		Проводка.СчетКт = УчетныйАктив.СчетУчетаПереоценкиА;
		Проводка.СубконтоКт.Контрагенты = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Банк.ЮрФизЛицо;
		Проводка.СубконтоКт.УсловияЗаймовКредитовИДепозитов	= ЭтотОбъект.КредитныйИнструмент;
		Проводка.ВалютаКт  = ЭтотОбъект.РасчетныйСчет.Валюта;
		Проводка.ВалютнаяСуммаКт = ЭтотОбъект.Сумма;
		// пришли %

		ОценочнаяСтоимость = РаботаСКредитнымиИнструментами.ПолучитьСтоимостьКредитногоИнструмента(ЭтотОбъект.КредитныйИнструмент, ЭтотОбъект.Дата, ЭтотОбъект.СчетДоверительногоУправления);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	БухгалтерскийУчетОстатки.СуммаОстатокДт + ДенежныеСредстваВКредитныхИнструментахОстатки.СуммаОстаток КАК БалансоваяСумма
			|ИЗ
			|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Остатки(
			|			&Период,
			|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.Депозиты03),
			|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.УсловияЗаймовКредитовИДепозитов),
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
			|				И Субконто1 = &КредитныйИнструмент) КАК БухгалтерскийУчетОстатки,
			|	РегистрНакопления.ДенежныеСредстваВКредитныхИнструментах.Остатки(
			|			&Период,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
			|				И КредитныйИнструмент = &КредитныйИнструмент) КАК ДенежныеСредстваВКредитныхИнструментахОстатки";

		Запрос.УстановитьПараметр("Организация",                  ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("Период",                       ЭтотОбъект.Дата);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
		Запрос.УстановитьПараметр("СчетДоверительногоУправленияДляУчета", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ЭтотОбъект.СчетДоверительногоУправления));
		Запрос.УстановитьПараметр("КредитныйИнструмент",		  ЭтотОбъект.КредитныйИнструмент);

		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			БалансоваяСумма = ВыборкаДетальныеЗаписи.БалансоваяСумма;
		Иначе
			БалансоваяСумма = 0;
		КонецЕсли;
		
		ДоначислитьПроцентов = ОценочнаяСтоимость - БалансоваяСумма;
		
		Если ДоначислитьПроцентов <> 0 Тогда
			
			// доначислим %
			СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ДоначислитьПроцентов, ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Доначисление процентов по депозитному вкладу");
			
			Проводка.СчетДт = УчетныйАктив.СчетУчетаПереоценкиА;
			Проводка.СубконтоДт.Контрагенты = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Банк.ЮрФизЛицо;
			Проводка.СубконтоДт.УсловияЗаймовКредитовИДепозитов = ЭтотОбъект.КредитныйИнструмент;
			Проводка.ВалютаДт  = ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта;
			Проводка.ВалютнаяСуммаДт = ДоначислитьПроцентов;
			
			Проводка.СчетКт = ПланыСчетов.Единый.ПроцентныеДоходы01;
			Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктив.АналитикаПроцентныхДоходов;
			Проводка.СубконтоКт.ЦенныеБумаги = ЭтотОбъект.КредитныйИнструмент;
			
		КонецЕсли;
		
		Если Закрывать7ойРазделПриПоступленииДенежныхСредств Тогда
		
			БухгалтерскийУчетЕПС.ОтнесениеНачисленныхДоходовНаАктивыВДУ(ЭтотОбъект, ПланыСчетов.Единый.ПроцентныеДоходы01, ЭтотОбъект.КредитныйИнструмент, ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта, "Закрытие доначисления процентов по депозитному вкладу");
		
		КонецЕсли;
	
	КонецЕсли;
	
	РасчетныеДанныеДепозита = Новый Структура("ЭффективнаяСтавкаПроцента,ИспользоватьЭффективнуюПроцентнуюСтавку,СтоимостьПоЭффективнойПроцентнойСтавке", 0, Ложь, ОценочнаяСтоимость);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасчетныеПоказателиДепозитногоВкладаСрезПоследних.ЭффективнаяСтавкаПроцента КАК ЭффективнаяСтавкаПроцента,
		|	РасчетныеПоказателиДепозитногоВкладаСрезПоследних.ИспользоватьЭффективнуюПроцентнуюСтавку КАК ИспользоватьЭффективнуюПроцентнуюСтавку,
		|	РасчетныеПоказателиДепозитногоВкладаСрезПоследних.СтоимостьПоЭффективнойПроцентнойСтавке КАК СтоимостьПоЭффективнойПроцентнойСтавке
		|ИЗ
		|	РегистрСведений.РасчетныеПоказателиДепозитногоВклада.СрезПоследних(
		|			&Период,
		|			ДепозитныйВклад = &ДепозитныйВклад
		|				И ЦельРасчета = &ЦельРасчета) КАК РасчетныеПоказателиДепозитногоВкладаСрезПоследних";
	
	Запрос.УстановитьПараметр("ДепозитныйВклад", ЭтотОбъект.КредитныйИнструмент);
	Запрос.УстановитьПараметр("ЦельРасчета", Справочники.ЦелиРасчета.ЕдиныйПланСчетов);		
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Дата);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(РасчетныеДанныеДепозита, ВыборкаДетальныеЗаписи);
	КонецЕсли;

	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		УчетныйАктив,
		УчетныйРегистр);
		
	НастройкиУчетаОбщие = БухгалтерскийУчет.ОпределитьНастройкиУчета(
		ЭтотОбъект.Дата, 
		ЭтотОбъект.Организация, 
		ЭтотОбъект.СчетДоверительногоУправления);		
		
	
		Если РасчетныеДанныеДепозита.ИспользоватьЭффективнуюПроцентнуюСтавку Тогда
			
			СтоимостьВкладаПоЭСП = Справочники.ДепозитныеВклады.РасчитатьСтоимостьПоЭСП(
				ЭтотОбъект.КредитныйИнструмент,
				НачалоДня(ЭтотОбъект.Дата),
				Справочники.ЦелиРасчета.ЕдиныйПланСчетов,
				НастройкиУчетаОбщие.РазрядностьОкругленияПромежуточныхРасчетовДепозитныхВкладов);
				
			БухгалтерскийУчетЕПС.ПровестиКорректировкуЭСП(ЭтотОбъект, ЭтотОбъект.КредитныйИнструмент, ОценочнаяСтоимость, СтоимостьВкладаПоЭСП);
			
		КонецЕсли;
	
	БухгалтерскийУчетЕПС.ЗакрытьПарныеСчетаДоходовРасходов(ЭтотОбъект, УчетныйАктив, Ложь, Истина, ЭтотОбъект.КредитныйИнструмент, Отказ);
	
	Если РасчетныеДанныеДепозита.ИспользоватьЭффективнуюПроцентнуюСтавку И Закрывать7ойРазделПриПоступленииДенежныхСредств Тогда
		БухгалтерскийУчетЕПС.ЗакрытьКорректировки710(ЭтотОбъект, ЭтотОбъект.КредитныйИнструмент);
	КонецЕсли;
	
	Если Закрывать7ойРазделПриПоступленииДенежныхСредств Тогда // закроем корректировку ПП
		БухгалтерскийУчетЕПС.ЗакрытьКорректировки710(ЭтотОбъект, ЭтотОбъект.КредитныйИнструмент,,,, Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт
	
	Движения[УчетныйРегистр].Записывать = Истина;
	
	Если ТипЗнч(ЭтотОбъект.КредитныйИнструмент) = Тип("СправочникСсылка.Займы") Тогда
		ПроведениеПоРегиструБухгалтерииЗайм(УчетныйРегистр, Отказ);
		Возврат;
	КонецЕсли;
		
	СчетУчетаАктивов = БухгалтерскийУчет.ОпределитьСчетУчетаАктивов(
		ЭтотОбъект.Дата, 
		ЭтотОбъект.Организация, 
		ЭтотОбъект.СчетДоверительногоУправления,
		Справочники.УчетныеАктивы.ДепозитныеВклады,
		УчетныйРегистр);
		
	СчетУчетаПереоценкиАктивов = БухгалтерскийУчет.ОпределитьСчетУчетаПереоценкиАктивов(
		ЭтотОбъект.Дата, 
		ЭтотОбъект.Организация, 
		ЭтотОбъект.СчетДоверительногоУправления,
		Справочники.УчетныеАктивы.ДепозитныеВклады,
		УчетныйРегистр);
		
	СчетУчетаДенежныхСредств = БухгалтерскийУчет.ОпределитьСчетУчетаДенежныхСредств(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта,
		Справочники.БрокерскиеКомпании.ПустаяСсылка());
		
	АналитикаДоходов = БухгалтерскийУчет.ОпределитьНастройкуУчетаАктива(
		ЭтотОбъект.Дата, 
		ЭтотОбъект.Организация, 
		ЭтотОбъект.СчетДоверительногоУправления,
		Справочники.УчетныеАктивы.ДепозитныеВклады,
		УчетныйРегистр,
		"АналитикаДоходов");
		
	УчитыватьДосрочноПолученныеПроцентыВДоходахБудущихПериодов = БухгалтерскийУчет.ОпределитьНастройкуУчетаАктива(
		ЭтотОбъект.Дата,
		ЭтотОбъект.Организация,
		ЭтотОбъект.СчетДоверительногоУправления,
		Справочники.УчетныеАктивы.ДепозитныеВклады,
		УчетныйРегистр,
		"УчитыватьДосрочноПолученныеПроцентыВДоходахБудущихПериодов");		
		
	Если УчитыватьДосрочноПолученныеПроцентыВДоходахБудущихПериодов 
		 И ЭтотОбъект.ОкончаниеПериода - ЭтотОбъект.Дата > 5 * 24*60*60
	Тогда // 5 дней - эмпирически
		ЭтоДосрочныйПриходПроцентов = Истина;
	Иначе
		ЭтоДосрочныйПриходПроцентов = Ложь;
	КонецЕсли;	
	
	// ПРИХОД ПРОЦЕНТОВ
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], ЭтотОбъект.Сумма, "Приход процентов по депозиту");
	
	// дебет
	Если ЭтотОбъект.Реинвестирование Тогда
		Проводка.СчетДт = СчетУчетаАктивов;
		Проводка.СубконтоДт.ДепозитныеВклады = ЭтотОбъект.КредитныйИнструмент;
	Иначе
		Проводка.СчетДт = СчетУчетаДенежныхСредств;
		Если Проводка.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета)  <> Неопределено Тогда 
			Проводка.СубконтоДт.БанковскиеСчета = ЭтотОбъект.РасчетныйСчет;
		КонецЕсли;
				
		Если СчетУчетаДенежныхСредств.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств) <> Неопределено Тогда 
			Проводка.СубконтоДт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ПроцентыПоДепозитномуВкладу;
		КонецЕсли;	
	КонецЕсли;
	
	// кредит
	Если Не ЭтоДосрочныйПриходПроцентов Тогда
		Проводка.СчетКт = СчетУчетаПереоценкиАктивов;
		Проводка.СубконтоКт.ДепозитныеВклады = ЭтотОбъект.КредитныйИнструмент;
	Иначе
		Проводка.СчетКт = ПланыСчетов.Основной.ДоходыБудущихПериодов;
		Проводка.СубконтоКт.ПрочиеДоходыИРасходы = АналитикаДоходов;
		Проводка.СубконтоКт.ЦенныеБумаги         = ЭтотОбъект.КредитныйИнструмент;
	КонецЕсли;
	
	// ДОНАЧИСЛЕНИЕ ПРОЦЕНТОВ
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БухгалтерскийУчетОстатки.СуммаОстатокДт
		|ИЗ
		|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|			&Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПроцентыПоДепозитнымВкладам),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ДепозитныеВклады),
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправленияДляУчета
		|				И Субконто1 = &КредитныйИнструмент) КАК БухгалтерскийУчетОстатки";

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", УчетныйРегистр);
		
	Запрос.УстановитьПараметр("Период",                       ЭтотОбъект.Дата);	
	Запрос.УстановитьПараметр("КредитныйИнструмент",          ЭтотОбъект.КредитныйИнструмент);
	Запрос.УстановитьПараметр("Организация",                  ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("СчетДоверительногоУправленияДляУчета", Справочники.СчетаДоверительногоУправления.ПолучитьСчетДляУчета(ЭтотОбъект.СчетДоверительногоУправления));

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		НачисленоПроцентов = Выборка.СуммаОстатокДт;
	Иначе
		НачисленоПроцентов = 0;
	КонецЕсли;
	
	ДоначислитьПроцентов = НачисленоПроцентов - ЭтотОбъект.Сумма;
	
	Если ДоначислитьПроцентов < 0 И Не ЭтоДосрочныйПриходПроцентов Тогда
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], ЭтотОбъект.Сумма - НачисленоПроцентов, "Начисление процентов по депозиту");
		
		// дебет
		Проводка.СчетДт = СчетУчетаПереоценкиАктивов;
		Проводка.СубконтоДт.ДепозитныеВклады = ЭтотОбъект.КредитныйИнструмент;
		
		// Кредит
		Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
		Проводка.СубконтоКт.ПрочиеДоходыИРасходы = АналитикаДоходов;
		Проводка.СубконтоКт.ЦенныеБумаги         = ЭтотОбъект.КредитныйИнструмент;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроведениеПоРегиструБухгалтерииЗайм(УчетныйРегистр, Отказ)

	ПараметрыУчетаАктива = Новый Структура;
	
	ДанныеКредитногоИнструмента = РаботаСКредитнымиИнструментами.ПолучитьДанныеКредитногоИнструмента(ЭтотОбъект.КредитныйИнструмент, ЭтотОбъект.Дата); 

	УчетныйАктив = БухгалтерскийУчет.ОпределитьУчетныйАктив(ЭтотОбъект.Дата,, ЭтотОбъект.КредитныйИнструмент);
	ОсновнойВидЗадолженности = Справочники.ВидыЗадолженности.ПоЗайму;
	ВидЗадолженности = Справочники.ВидыЗадолженности.ПоЗаймуПроценты;

	ПараметрыУчетаАктива.Вставить("УчетныйАктив", УчетныйАктив);
	ПараметрыУчетаАктива.Вставить("Актив", ЭтотОбъект.КредитныйИнструмент);
	
	ПараметрыУчетаАктива.Вставить("АналитикаПереоценки", 
		БухгалтерскийУчет.ОпределитьНастройкуУчетаАктива(
			Дата, 
			Организация, 
			СчетДоверительногоУправления, 
			УчетныйАктив, 
			УчетныйРегистр, 
			"АналитикаДоходовОтПереоценки"));
	
	ПараметрыУчетаАктива.Вставить("АналитикаДоходов", 
		БухгалтерскийУчет.ОпределитьНастройкуУчетаАктива(
			Дата, 
			Организация, 
			СчетДоверительногоУправления, 
			УчетныйАктив, 
			УчетныйРегистр, 
			"АналитикаДоходов"));
	
	ПараметрыУчетаАктива.Вставить("СчетПереоценкиРасчетов",
		БухгалтерскийУчет.ОпределитьСчетУчетаПереоценкиАктивов(
			Дата, 
			Организация, 
			СчетДоверительногоУправления, 
			УчетныйАктив, 
			УчетныйРегистр));
	
	ПараметрыУчетаАктива.Вставить("СчетУчетаРасчетовПоДоходам",
		ПланыСчетов.Основной.РасчетыСПрочимиПоставщикамиИПодрядчиками);
	
	ПараметрыУчетаАктива.Вставить("СчетУчетаАктива",
		БухгалтерскийУчет.ОпределитьСчетУчетаАктивов(
			ЭтотОбъект.Дата, 
			ЭтотОбъект.Организация, 
			ЭтотОбъект.СчетДоверительногоУправления, 
			УчетныйАктив, 
			УчетныйРегистр));
	
	ПараметрыУчетаАктива.Вставить("Контрагент", ДанныеКредитногоИнструмента.Контрагент);
	ПараметрыУчетаАктива.Вставить("ОтложеннаяОплата", ЭтотОбъект.ОтложеннаяОплата);
	ПараметрыУчетаАктива.Вставить("РасчетныйСчет", ЭтотОбъект.РасчетныйСчет);
		
	Документы.ПриходПроцентовПоКредитномуИнструменту.ОтразитьНачислениеПроцентовПоРегиструБухгалтерии(ЭтотОбъект.Ссылка, Движения[УчетныйРегистр], УчетныйРегистр, ПараметрыУчетаАктива, ЭтотОбъект.Сумма, Отказ);
		
КонецПроцедуры


#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
	// очистим персонифицированные реквизиты
	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект, "Сумма, НачалоПериода, ОкончаниеПериода, СтрокаБанковскойВыписки");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не Реинвестирование Тогда
		ПроверяемыеРеквизиты.Добавить("РасчетныйСчет");
	КонецЕсли;
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
		
		ЭтоДепозитныйВклад = ТипЗнч(ЭтотОбъект.КредитныйИнструмент) = Тип("СправочникСсылка.ДепозитныеВклады");
		
		Если Не Реинвестирование Тогда
			
			Если ЭтоДепозитныйВклад И ЭтотОбъект.РасчетныйСчет.Валюта <> ЭтотОбъект.КредитныйИнструмент.БанковскийСчет.Валюта Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта р/счета " + ЭтотОбъект.РасчетныйСчет + " не совпадает с валютой банковского счета " + ЭтотОбъект.КредитныйИнструмент.БанковскийСчет + " депозитного вклада " + ЭтотОбъект.КредитныйИнструмент, ЭтотОбъект, "КредитныйИнструмент",, Отказ);
			КонецЕсли;
			
			Если РаботаСКредитнымиИнструментами.НеобходимоЗаполнениеЗначенияРасчетногоСчетаВозвратаДенежныхСредств(ЭтотОбъект.Организация, ЭтотОбъект.КредитныйИнструмент) Тогда
				
				СчетВозвратаДенежныхСредств = РаботаСКредитнымиИнструментами.ПолучитьРасчетныйСчетВозвратаДенежныхСредств(ЭтотОбъект.Дата, ЭтотОбъект.Организация, ЭтотОбъект.КредитныйИнструмент);
				
				Если ЭтотОбъект.РасчетныйСчет <> СчетВозвратаДенежныхСредств Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расчетный счет [" + ЭтотОбъект.РасчетныйСчет + "] не совпадает со счетом возврата денежных средств [" + СчетВозвратаДенежныхСредств + "] в условиях кредитного инструмента.", ЭтотОбъект, "РасчетныйСчет",, Отказ);	
				КонецЕсли;
				
			Иначе
			
				Если Не РаботаСИсполнителями.ЕстьИсполнитель("ИсполнителиПоДенежнымСредствамСобственные", ЭтотОбъект) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расчетный счет [" + ЭтотОбъект.РасчетныйСчет + "] отсутствует в исполнителях (собственных) счета ДУ [" + ЭтотОбъект.СчетДоверительногоУправления + "].", ЭтотОбъект, "РасчетныйСчет",, Отказ);		
				КонецЕсли;
				
			Конецесли;
	
		Иначе
			Если ЗначениеЗаполнено(ЭтотОбъект.СтрокаБанковскойВыписки) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Строка банковской выписки может быть выбрана только при отсутствии реинвестирования", ЭтотОбъект, "Реинвестирование",, Отказ);
			КонецЕсли;
			Если НЕ ЭтоДепозитныйВклад Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Реинвестирование займов не предусмотрено", ЭтотОбъект, "Реинвестирование",, Отказ);
			КонецЕсли;
		КонецЕсли;

		Если ЭтотОбъект.НачалоПериода > ЭтотОбъект.ОкончаниеПериода Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата начала периода начисления процентов " + Формат(ЭтотОбъект.НачалоПериода, "ДФ=dd.MM.yyyy") + " больше даты окончания " + Формат(ЭтотОбъект.ОкончаниеПериода, "ДФ=dd.MM.yyyy"), ЭтотОбъект, "НачалоПериода",, Отказ);
		КонецЕсли; 
		
		ДанныеКредитногоИнструмента = РаботаСКредитнымиИнструментами.ПолучитьНоминалИДатуПогашенияКредитногоИнструмента(ЭтотОбъект);

		Если ЭтоДепозитныйВклад И ЭтотОбъект.КредитныйИнструмент.ДоВостребования И НЕ ЗначениеЗаполнено(ДанныеКредитногоИнструмента.ДатаПогашения) Тогда
			//Для депозитов "до востребования" дата погашения не контролируется
		ИначеЕсли ДанныеКредитногоИнструмента.ДатаПогашения = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У " + РаботаСКредитнымиИнструментами.НазваниеКредитногоИнструментаРодительныйПадеж(ЭтотОбъект.КредитныйИнструмент) 
				+ ЭтотОбъект.КредитныйИнструмент + " не указана дата погашения " , ЭтотОбъект, "КредитныйИнструмент",, Отказ);
		Иначе
			Если ЗначениеЗаполнено(ЭтотОбъект.ОкончаниеПериода) и (ЭтотОбъект.ОкончаниеПериода > ДанныеКредитногоИнструмента.ДатаПогашения) Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата окончания интервала, за который начисляются проценты - " + Формат(ЭтотОбъект.ОкончаниеПериода, "ДФ=dd.MM.yyyy") + ", не может быть больше даты погашения - " + Формат(ДанныеКредитногоИнструмента.ДатаПогашения, "ДФ=dd.MM.yyyy"), ЭтотОбъект, "ОкончаниеПериода",, Отказ);
			КонецЕсли;
		КонецЕсли;
		
		РаботаСКредитнымиИнструментами.ПроверитьУникальностьПериодаНачисленияПроцентов(ЭтотОбъект, Отказ);
		
		ВидДвиженияДС = Перечисления.ВидыДвижений.Приход;
		Если Не ЭтоДепозитныйВклад И ЭтотОбъект.КредитныйИнструмент.ВидКредитногоИнструмента = Перечисления.ВидыКредитныхИнструментов.Полученный Тогда
			ВидДвиженияДС = Перечисления.ВидыДвижений.Расход;
		КонецЕсли;
		
		РаботаСБанковскимиВыпискамиКлиентСервер.ПроверитьСоответствиеСтрокиБанковскойВыпискиИПлатежногоДокумента(ЭтотОбъект,
			ЭтотОбъект.СтрокаБанковскойВыписки, ВидДвиженияДС, Отказ);
			
		Если ЭтотОбъект.ОтложеннаяОплата И ТипЗнч(ЭтотОбъект.КредитныйИнструмент) = Тип("СправочникСсылка.Займы") Тогда
			Если  ЭтотОбъект.КредитныйИнструмент.ВидКредитногоИнструмента = Перечисления.ВидыКредитныхИнструментов.Выданный
				И НЕ ЗначениеЗаполнено(ЭтотОбъект.ДатаОплаты) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана плановая дата оплаты", ЭтотОбъект, "ДатаОплаты",, Отказ);
			КонецЕсли;
		КонецЕсли;
		
		Если ЭтотОбъект.ОтложеннаяОплата И ЗначениеЗаполнено(ЭтотОбъект.СтрокаБанковскойВыписки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При отложенной оплате не может быть заполнена банковская выписка", ЭтотОбъект, "СтрокаБанковскойВыписки",, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти
